from evolution_framework import send_messages_to_group

mavdak_group_id = "120363422345335152@g.us"

messages = [

f"""
עליכם להיות זמינים לשיחת פתיחה החל מהשעה 9:00 — אך ייתכן והקישור יישלח עד השעה 10:00.
כשהקישור יתפרסם, נעלה אותו כאן. אין צורך לשלוח הודעות בנושא.

בין אם התחברתם לשיחה ובין אם לא — להלן הקישור למבדק.
https://keinan-sheffy.com/kst2/exam/login

זמן פתיחת המבחן המשוער הוא סביב השעה 10:00, אך יתכן ותוכלו להיכנס גם מוקדם יותר.
"""
,

f"""במקרים של תקלה טכנית יש לפנות ל:
035630594
+972 52-735-0191

מי שיש לו תקלה אחרת לשלוח בפרומט הבא:

 בעיה במבחן המבד"ק 
 שם מלא:
מספר זהות:
 מייל:
פלאפון:
פירוט התקלה:

כל הפניות מועברות למדור מבדק. מי שהפנייה שלו לא קיבלה מענה לאחר 45 דקות מוזמן לשלוח הודעה בווטסאפ למספר זה - אחרת נתעלם.

""",

"""
קראו שוב את ההנחיות ואת ההודעות מלעיל ושיהיה בהצלחה לכולם!
"""

]

send_messages_to_group(messages, mavdak_group_id)