from evolution_framework import  create_group_and_invite, WhatsappGroupCreate


mavdak_date = "DATE"


forms_link = "FORMS_LINK"

iluzei_reaionot_mador_mavdak = "ILUZEI_REAIONOT_MADOR_MAVDAK"

group_messages = [ f"""
מועמדים יקרים,
אנחנו מדור קצונה של אגף התקשוב. 
המיון לקצונה ייערך באופן מקוון ויכלול מבחנים ממוחשבים וראיון זום עם פסיכולוג. 

*המיון והראיונות לא מתקיימים באותו היום. המיון יהיה ב{mavdak_date} עבור כולם, ובהמשך נעדכן תאריכי ראיונות בקבוצה.*

לקראת המבדק שמתקיים ב{mavdak_date}, הכנו כמה דגשים חשובים, יש לקרוא את כלל ההוראות באופן יסודי!

✅הכנות למבדק : 
•יש לוודא כי יש לכם מחשב עם מצלמה לביצוע המבחנים 
•אין אפשרות לבצע את המבחנים עם מחשב של אפל , התוכנה של המבחנים לא נפתחת במחשב הזה
•אין אפשרות לבצע את המבחנים ללא מצלמה
•המבדק הוא חובה , אין אפשרות להזיז תאריך ונדרש לעלות בזמן לביצוע המבחנים
•במהלך השבוע שלאחר המבדק ישלחו אליכם פרטים על מועד ראיון הפסיכולוג - פרטי התחברות לזום (אין קישור- יש קוד), תאריך , שעה וסיסמה
•את המבחנים ואת הראיון יש לערוך בחדר שקט ללא הפרעות חיצוניות. 

• *אם מישהו לא מעוניין לצאת לקצונה/לדחות מחזור - להודיע בהקדם האפשרי!*

✅יום המבחנים :
•ביום המבחנים , יישלח לכם מייל עם קישור למבחנים עצמם לקראת השעה 9:00
•בשעה 9:00 יתקיים תדריך בזום לקראת המבחנים עצמם שאת הקישור אליו תקבלו כאן בקבוצה, לאחר סיום התדריך יש להיכנס לקישור של המבחן האישי ולהתחיל אותו
•אם יש לכם תקלה בזמן המבחנים , תכתבו בקבוצה מה התקלה עם צילום של המסך מחשב 
•בתמונת הקבוצה יש תקלות נפוצות , לפני שאתם כותבים בקבוצה על תקלה - תסתכלו אם יש את הפיתרון שלה בתמונה
•אורך המבחנים הינו 4-5 שעות בממוצע ולכן יש לפנות את הזמן בהתאם לכך. 
•יש לעלות למבחנים על מדים


✅יום ראיון הפסיכולוג :
•אין לבצע את הראיון משטח פתוח , פוסלים על זה ראיון
• יש לוודא שאתם נמצאים בחדר שקט ללא רעשים ושיש לכם קליטה
•יש להכיר את מה שנכתב עליכם בחוו״ד 870 שכתב עליכם המפקד הישיר
•במידה ועליתם לראיון והשיחה עוד לא התחילה , תכתבו בקבוצה כדי שנברר מול מדור מבדק
•זמן הריאיון הוא בערך בין רבע שעה לעשרים דקות , משתנה בין חייל לחייל.
•יש לעלות לראיון על מדים
•ניתן להתחבר לראיון מאפליקציית זום בטלפון ויש להוריד את האפליקציה מראש למכשיר 
•בתחילת הראיון תדרשו להציג חוגר ולענות על כמה שאלות אימות
"""

,

iluzei_reaionot_mador_mavdak

,
f"""
היי לכולם. 
בבקשה להזין את פרטיכם בקובץ הבא לקראת המבדק שיתקיים {mavdak_date} החל מהשעה 9:00.
לוודא פעמיים שת.ז והמייל משוכתבים כמו שצריך

{forms_link}

"""
]


group_name = f"מבדק {mavdak_date}"

group_participants = [ "972532237008" ]

group_invite_msg_title = f"בבקשה להצטרף לקבוצה של המבדק שיתקיים ב {mavdak_date}"

mavdak_group = WhatsappGroupCreate(name=group_name,
                                   participants=group_participants,
                                   messages=group_messages,
                                   invite_msg_title=group_invite_msg_title,
                                   media=[])

mavdak_group_id = create_group_and_invite(mavdak_group)
print(f"Mavdak group ID: {mavdak_group_id}")

